Pandas - DataFrame and Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and cleaning. It provides two primary data structures: Series and DataFrame.
Pandas Series
A pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table. The basic difference between a Series and a DataFrame is that a Series is one-dimensional, while a DataFrame is two-dimensional, mutable, and can contain heterogeneous data.

In [1]:
!pip install pandas

Requirement already satisfied: pandas in e:\udemy\venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.22.4 in e:\udemy\venv\lib\site-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in e:\udemy\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in e:\udemy\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in e:\udemy\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in e:\udemy\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [2]:
#series
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series\n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
#CREATE SERIES FROM DICTIONERY ELEMENTS
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
#DATAFRAME
#CREATE A DATAFRAME FORM A DICTIONERY OF LIST
data={
    'Name':['Krish','john','Jack'],
    'Age':[25,32,45],
    'City':['Agra','Delhi','Mathura']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age     City
0  Krish   25     Agra
1   john   32    Delhi
2   Jack   45  Mathura
<class 'pandas.core.frame.DataFrame'>

In [8]:
#create a dataframe from list of dictionery
data = [
    {'name': 'Krish', 'age': 32, 'city': 'Bangalore'},
    {'name': 'John', 'age': 34, 'city': 'Bangalore'},
    {'name': 'Jack', 'age': 32, 'city': 'Bangalore'}
]
df = pd.DataFrame(data)
print(df)

    name  age       city
0  Krish   32  Bangalore
1   John   34  Bangalore
2   Jack   32  Bangalore

In [5]:
df=pd.read_csv('sales_data_sample.csv',encoding='latin-1')
print(df.head(5))

   ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0        10107               30      95.70                2  2871.00
1        10121               34      81.35                5  2765.90
2        10134               41      94.74                2  3884.34
3        10145               45      83.26                6  3746.70
4        10159               49     100.00               14  5205.27

         ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0   2/24/2003 0:00  Shipped       1         2     2003  ...
1    5/7/2003 0:00  Shipped       2         5     2003  ...
2    7/1/2003 0:00  Shipped       3         7     2003  ...
3   8/25/2003 0:00  Shipped       3         8     2003  ...
4  10/10/2003 0:00  Shipped       4        10     2003  ...

                    ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0        897 Long Airport Avenue           NaN            NYC    NY
1             59 rue de l'Abbaye           NaN          Reims   NaN
2  27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3             78934 Hillside Dr.           NaN       Pasadena    CA
4                7734 Strong St.           NaN  San Francisco    CA

  POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0      10022     USA       NaN              Yu             Kwai    Small
1      51100  France      EMEA         Henriot             Paul    Small
2      75508  France      EMEA        Da Cunha           Daniel   Medium
3      90003     USA       NaN           Young            Julie   Medium
4        NaN     USA       NaN           Brown            Julie   Medium

[5 rows x 25 columns]

In [6]:
df.tail(5)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [10]:
#accessing data from dataframe
df

    name  age       city
0  Krish   32  Bangalore
1   John   34  Bangalore
2   Jack   32  Bangalore

In [11]:
data

[{'name': 'Krish', 'age': 32, 'city': 'Bangalore'},
 {'name': 'John', 'age': 34, 'city': 'Bangalore'},
 {'name': 'Jack', 'age': 32, 'city': 'Bangalore'}]

In [12]:
df['name']

0    Krish
1     John
2     Jack
Name: name, dtype: object

In [13]:
df.loc[0]

name        Krish
age            32
city    Bangalore
Name: 0, dtype: object

In [14]:
df.iloc[0]

name        Krish
age            32
city    Bangalore
Name: 0, dtype: object

In [15]:
df.loc[0][0]

C:\Users\Asus\AppData\Local\Temp\ipykernel_22304\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [16]:
df.iloc[0][0]

C:\Users\Asus\AppData\Local\Temp\ipykernel_22304\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Krish'

In [17]:
#Accessing a specified element
df['name']

0    Krish
1     John
2     Jack
Name: name, dtype: object

In [18]:
df.at[1,'age']

np.int64(34)

In [20]:
df.at[2,'name']

'Jack'

In [21]:
#accessing a specified element using iat
df.iat[2,2]

'Bangalore'

In [23]:
#data manipulation with dataframe
df
#adding a new column salary with data
df['salary']=[5000,6000,7000]
df

    name  age       city  salary
0  Krish   32  Bangalore    5000
1   John   34  Bangalore    6000
2   Jack   32  Bangalore    7000

In [ ]:
#remove a column
df.drop('salary',axis=1)  #axis=1 denoted that salary is in column
#by default axis=0 which denotes row
#it is not permanent operation like if i will run df now then salary column will show again

    name  age       city
0  Krish   32  Bangalore
1   John   34  Bangalore
2   Jack   32  Bangalore

In [25]:
df

    name  age       city  salary
0  Krish   32  Bangalore    5000
1   John   34  Bangalore    6000
2   Jack   32  Bangalore    7000

In [26]:
#permanent removal of column
df.drop('salary',axis=1,inplace=True)
df

    name  age       city
0  Krish   32  Bangalore
1   John   34  Bangalore
2   Jack   32  Bangalore

In [27]:
df

    name  age       city
0  Krish   32  Bangalore
1   John   34  Bangalore
2   Jack   32  Bangalore

In [28]:
#add age to column
df['age']=df['age']+1
df

    name  age       city
0  Krish   33  Bangalore
1   John   35  Bangalore
2   Jack   33  Bangalore

In [29]:
df.describe()

             age
count   3.000000
mean   33.666667
std     1.154701
min    33.000000
25%    33.000000
50%    33.000000
75%    34.000000
max    35.000000